# RibbonItemEventArgs Properties

---
The RibbonItemEventArgs type exposes the following members.
| Name| Description
---|---|---
| Application|  The current UIApplication.
Top
#### Reference
RibbonItemEventArgs Class
Autodesk.Revit.UI.Events Namespace